Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PointHandle
Represents a handle that is represented as a point on the model.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PointHandle.#ctor(Tekla.BIM.DirectManipulation.Services.Interaction.IPointHandle)
Creates an instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PointHandle class.
nativeHandle: Underlying DM handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PointHandle.WrappedHandle
Gets the underlying segment handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PointHandle.Point
Gets the segment that the handle represents.